erpdev.СХК_Расширение/src/DataProcessors/ЗапросКоличестваИСерий/ЗапросКоличестваИСерий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fcf2c116-338e-493e-9e84-da5e762b4907">
  <name>ЗапросКоличестваИСерий</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="4eb402ab-d736-4703-ac6b-f1a445d0cafe">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1cc532ee-6341-43e0-a167-a39248d2aeda">
    <name>ВариантОбеспечения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4bc2d915-b807-42e6-a7bf-53da411ce157">
    <name>Обособленно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e68313dd-8fdf-427d-8eea-2ea3ae8f7756">
    <name>КоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7dee39b9-5f05-4bb0-be66-b7f45d54779b">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e467ba8e-a843-440f-810a-c02b8bfd89bf">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="805ab58e-5025-465d-854e-11d24f2cc1b1">
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="177900a0-3a69-4157-a927-905597434660">
    <name>Доступно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="54394598-cab3-4e83-9734-6ba5edbc0f17">
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bc2d4e3e-a645-4fa5-80d3-cab530552106">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="01feec12-7905-425e-8239-c37a8e158322">
    <name>ПроцентРучнойСкидкиНаценки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="898127fc-f563-4ce6-bb68-2fdd16244614">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="2d1723b6-e21a-4901-85e1-335188d65f71">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="53f62b68-1657-47b9-8dd9-c6166a951250">
      <name>Подобрано</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="aafa6d2f-275d-4643-8a47-2b61be4b8500">
      <name>ВРезерве</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="51b64ca7-c505-4f9a-8737-d55758039e4c">
      <name>КартинкаПереместитьВправо</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>1</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c50d2c27-bb79-4887-89c3-08f2f8cf405e">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="15382bb5-6185-423d-90a0-410c76e4749b">
      <name>ВНаличии</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e7470a85-ece7-41a4-ab64-4fbac538aa1d">
      <name>ПоГрафику</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="3bc30e9f-5269-474b-9530-fb24cf8cb1c2">
    <name>СоставНабора</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e6593528-441e-4376-9d56-62b75ce0c1a5">
      <name>ВНаличии</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="be295070-711f-4349-8f79-6d261711783b">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6544a1d9-6e69-417d-8281-322291b17409">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3697cac1-f624-49d6-bf20-ec1ff8011e4c">
      <name>КоличествоПодобрать</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b6fae266-1372-4f98-95db-64aaf169bafd">
      <name>КоличествоПодобрано</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="10ffcb0a-6468-4d22-ba5d-8dd29ab71ee6">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="61fa94c8-aa8b-413d-aaeb-9d415e00ed33">
      <name>Доступно</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="271a6a48-ef9c-4ad5-af89-24136d82049c">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="d5364458-e4c8-483e-ae67-74799c758fcc">
    <name>Серии</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b9292f3d-bd36-4e3c-9d3b-07cdf6e65377">
      <name>ПроизводительВЕТИС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5dc4b3f0-dc66-4d7a-93b6-77e25c49905c">
      <name>Номер</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e950edb0-b657-45f9-882c-e2ce2427aac1">
      <name>ИдентификаторПартииВЕТИС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="472496f4-d904-411f-b2db-fbe3292738ed">
      <name>ДатаПроизводства</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e6eec5f2-3cc3-4e23-bf8a-9f1f78464a15">
      <name>ГоденДо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="28b6b86a-3641-4049-a9c0-12d1188793ac">
      <name>НомерКиЗГИСМ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3740b017-27e5-4caa-8381-95909f270a64">
      <name>ПроизводительЕГАИС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="06c2363e-382c-4b37-bf2e-f2b4589edd79">
      <name>Справка2ЕГАИС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b74c1489-3682-491a-b81d-efb593a41424">
      <name>ЗаписьСкладскогоЖурналаВЕТИС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6d0c67d4-3850-4250-96ec-527d5a9d6edb">
      <name>МаксимальнаяРозничнаяЦенаМОТП</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="83f9fc8c-aea3-4324-b43f-77fa5506655a">
      <name>Доступно</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="23ca9f64-18d6-4eac-a176-1617a9761f90">
      <name>Подобрано</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ОстаточныйСрокГодности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйОСГ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/DataProcessors/ЗапросКоличестваИСерий/ManagerModule.bsl
&Вместо("ЗаполнитьСерииДляСтрокиТовары")
Процедура Расш1_ЗаполнитьСерииДляСтрокиТовары(Форма, КлючевыеПараметры, ИндексСтроки, ПараметрыУказанияСерий) Экспорт
	
	ПодборСерий = КлючевыеПараметры.ПодборСерий;
	Объект = Форма.Объект;
	Строка = Объект.Товары[ИндексСтроки];
	
	Если Не ПодборСерий
			Или Строка.СтатусУказанияСерий = 0
			Или Строка.НомерПервойСтрокиСерий <> 0
			Или Строка.Обособленно
				И Не ЗначениеЗаполнено(Строка.Назначение) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("Номенклатура,Характеристика,Склад,Обособленно");
	ЗаполнитьЗначенияСвойств(СтруктураОтбора, Строка);
	
	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Номенклатура, "ВидНоменклатуры");
	
	ВариантПолученияДанных = Обработки.ПодборСерийВДокументы.ВариантПолучениеДанныхИзРегистровПоПараметрамФормы(
		ПараметрыУказанияСерий,
		Неопределено,
		Строка.Склад,
		ВидНоменклатуры);
		
	Если ЭтоАдресВременногоХранилища(Форма.Параметры.АдресТаблицыПодобраноРанее) Тогда
		
		Если КлючевыеПараметры.ПодборТоваров Тогда
			ПодобраноРанее = ПолучитьИзВременногоХранилища(Форма.Параметры.АдресТаблицыПодобраноРанее).Скопировать(СтруктураОтбора);
		Иначе
			ПодобраноРанее = ПолучитьИзВременногоХранилища(Форма.Параметры.АдресТаблицыПодобраноРанее);
		КонецЕсли;
		
	Иначе
		
		ПодобраноРанее = Новый ТаблицаЗначений();
		ПодобраноРанее.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
		ПодобраноРанее.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура",   Строка.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Строка.Характеристика);
	Запрос.УстановитьПараметр("Назначение",     Строка.Назначение);
	Запрос.УстановитьПараметр("Склад",          Строка.Склад);
	Запрос.УстановитьПараметр("Помещение",      Справочники.СкладскиеПомещения.ПустаяСсылка());
	Запрос.УстановитьПараметр("Регистратор",    Объект.Регистратор);
	Запрос.УстановитьПараметр("Распоряжение",   Неопределено);
	Запрос.УстановитьПараметр("ПодобраноРанее", ПодобраноРанее);
	Запрос.УстановитьПараметр("ВсеСерии",       Истина);
	
	ТекстыЗапроса = Новый Массив();
	ТекстЗапроса = Обработки.ПодборСерийВДокументы.ТекстЗапросаФормированияТаблицыДанныеРегистров(
		ВариантПолученияДанных,
		Строка.Склад);
		
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	Таблица.Серия      КАК Серия,
		|	Таблица.Количество КАК Количество
		|ПОМЕСТИТЬ ТаблицаТоваров
		|ИЗ
		|	&ПодобраноРанее КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таблица.Серия             КАК Серия,
		|	СУММА(Таблица.Количество) КАК Количество
		|ПОМЕСТИТЬ ПодобраноРанее
		|ИЗ
		|	ТаблицаТоваров КАК Таблица
		|СГРУППИРОВАТЬ ПО
		|	Таблица.Серия
		|ИНДЕКСИРОВАТЬ ПО
		|	Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеРегистров.Серия                                                    КАК Серия,
		|	ДанныеРегистров.СвободныйОстаток - ЕСТЬNULL(ПодобраноРанее.Количество,0) КАК Доступно,
		|	&ТекстЗапросаРеквизитыСерийВыборка
		|ИЗ
		|	ДанныеРегистров КАК ДанныеРегистров
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПодобраноРанее КАК ПодобраноРанее
		|		ПО ПодобраноРанее.Серия = ДанныеРегистров.Серия
		|УПОРЯДОЧИТЬ ПО
		|	ГоденДо,
		|	Номер";
	
	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Номенклатура, "ВидНоменклатуры");
	НастройкиИспользованияСерий = Справочники.ВидыНоменклатуры.НастройкиИспользованияСерий(
		ВидНоменклатуры,
		ПараметрыУказанияСерий,
		Новый Структура("Склад", Строка.Склад));
	Подстановка = Обработки.ПодборСерийВДокументы.ТекстЗапросаРеквизитыСерий("ДанныеРегистров", НастройкиИспользованияСерий, Ложь);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаРеквизитыСерийВыборка", Подстановка);
	
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	Запрос.Текст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаОстатков.Количество() = 0 Тогда
		НомерПервойСтрокиСерий = -1;
	Иначе
		НомерПервойСтрокиСерий = Объект.Серии.Количество() + 1;
	КонецЕсли;
	
	Для Каждого СтрокаСерий Из ТаблицаОстатков Цикл
		
		НоваяСтрокаСерий = Объект.Серии.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСерий, Строка, "Номенклатура,Характеристика,Склад,Назначение");
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСерий, СтрокаСерий);
		НоваяСтрокаСерий.ПроверятьДоступность = НоваяСтрокаСерий.Доступно > 0;
		
	КонецЦикла;
	
	УправлениеСвойствамиУТ.ЗаполнитьКолонкиДополнительныхРеквизитов(
		Форма,
		"Объект.Серии",
		"Серия");
	
	НайденныеСтроки = Объект.Товары.НайтиСтроки(СтруктураОтбора);
	Для Каждого Строка Из НайденныеСтроки Цикл
		Строка.НомерПервойСтрокиСерий = НомерПервойСтрокиСерий;
	КонецЦикла;
//+
	Для Каждого Стр из Объект.Серии Цикл
		ДатаПроизводства = ДобавитьМесяц(Стр.ГоденДо,Стр.Номенклатура.СрокГодности*(-1));
		КолВоДнейСрокагодности = Стр.ГоденДо - ДатаПроизводства;
		ОстаточныйСрок = Стр.годенДо - ТекущаяДата();
		Если ОстаточныйСрок < 0 Тогда
			Стр.ОстаточныйСрокГодности = "Не годен";
		Иначе
			Если КолВоДнейСрокагодности = 0 Тогда
				Процент = 0;
			Иначе
				Процент = окр(ОстаточныйСрок*100/КолВоДнейСрокагодности);
			КонецЕСли;
			Если Процент > 100 Тогда
				Процент = 100;
			КонецЕсли;
			Стр.ОстаточныйСрокГодности = Строка(Процент);
		КонецЕсли;
	КонецЦикла;																						

//-
КонецПроцедуры
